content/posts/Consciousness_and_intentionality_in_the_Stanford_Encyclopedia_of_Philosophy.md
+++
title = "Consciousness and intentionality in the Stanford Encyclopedia of Philosophy"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:34:11-04:00
slug = "Consciousness_and_intentionality_in_the_Stanford_Encyclopedia_of_Philosophy"
draft = false
+++

## <https://plato.stanford.edu/entries/consciousness-intentionality/> {#https-plato-dot-stanford-dot-edu-entries-consciousness-intentionality}


## [What It Is Like to Perceive Direct Realism and the Phenomenal Character of Perception by J Christopher Maloney in 2018]({{< relref "What_It_Is_Like_to_Perceive_Direct_Realism_and_the_Phenomenal_Character_of_Perception_by_J_Christopher_Maloney_in_2018" >}}) {#what-it-is-like-to-perceive-direct-realism-and-the-phenomenal-character-of-perception-by-j-christopher-maloney-in-2018--what-it-is-like-to-perceive-direct-realism-and-the-phenomenal-character-of-perception-by-j-christopher-maloney-in-2018-dot-md}


## references {#references}


### Clark, A. and David J. Chalmers, 1998, “The Extended Mind”, \_\_Analysis\_\_, 58: 10–23. doi: 10.1093/analys/58.1.7 {#clark-a-dot-and-david-j-dot-chalmers-1998-the-extended-mind-analysis-58-10-23-dot-doi-10-dot-1093-analys-58-dot-1-dot-7}


### Davidson, D., 1982, “Empirical Content”, \_\_Grazer Philosophische Studien\_\_, 16–17: 471–489. {#davidson-d-dot-1982-empirical-content-grazer-philosophische-studien-16-17-471-489-dot}


### Husserl, Edmund, [1900] 1970, \_\_Logical Investigations\_\_, J. Findlay (trans.), Abingdon, UK: Routledge. {#husserl-edmund-1900-1970-logical-investigations-j-dot-findlay--trans-dot--abingdon-uk-routledge-dot}


### Nagel, Thomas, 1976, “What Is It Like To Be a Bat?”, \_\_Philosophical Review\_\_, 4(83): 435–450. {#nagel-thomas-1976-what-is-it-like-to-be-a-bat-philosophical-review-4--83--435-450-dot}


### Putnam, Hilary, 1975, “The Meaning of ‘Meaning,’” \_\_Minnesota Studies in the Philosophy of Science\_\_, 7: 131–193 {#putnam-hilary-1975-the-meaning-of-meaning-minnesota-studies-in-the-philosophy-of-science-7-131-193}


### Rorty, Richard, 1979, \_\_Philosophy and the Mirror of Nature\_\_, Princeton: Princeton University Press. {#rorty-richard-1979-philosophy-and-the-mirror-of-nature-princeton-princeton-university-press-dot}


### Wittgenstein, Ludwig, 1953, \_\_Philosophical Investigations\_\_, G.E.M. Anscombe (trans.), New York: Macmillan. {#wittgenstein-ludwig-1953-philosophical-investigations-g-dot-e-dot-m-dot-anscombe--trans-dot--new-york-macmillan-dot}
